zannex
narcotic
sleep
hate
stinks
patches
tweet
lord
sorry
worth
jack
screaming
tickets
school
wednesday
oooo
oooh
flexoril
epharmacy
straight
enjoy
tired
surrounding
street
7th
10s
blue
understandability
nei
fingers
bipolar
disney
told
med
kicked
carebear
pluto
100
kids
leaves
smoke
aka
eyebrows
fantastic
replace
bro
cocaine
trazodone
derivatives
hospital
dnt
call
calm
type
holy
relax
brings
haha
infusion
hurt
phone
warm
shoot
intake
mf
ma
1998
work
movies
ms
vodka
hellva
give
household
kalonapin
gotdam
amboy
honest
busch
loathe
end
recovery
song
feature
writers
answer
beach
badly
fever
elizabeth
mess
earlier
wrong
law
lap
purchase
attempt
effective
10ssss
order
wine
riri
walgreens
sickle
thesis
ima
pharma
fit
flexcerall
recreational
ak47s
fade
coffee
combination
safe
break
band
roommate
effects
silver
bouta
indictment
doped
leaned
roast
fitness
addicted
side
bone
luck
signing
taught
forgot
message
driving
rs
god
hooked
mason
strangers
smh
medicine
rn
rehearsed
harry
free
sheet
wanted
certified
hister
mvp
ate
starts
days
filter
fuckin
tijuana
steroids
wash
delicious
comic
blunts
service
top
needed
ton
tom
legs
listen
gym
serve
wisdom
hadnt
hips
anxiety
binds
5mg
lehigh
feeling
boston
mine
glass
talking
mins
strength
1960
chest
rider
norco
ails
clonazepam
doin
denominator
anatomy
regular
mouth
addict
cobcga
dummy
smoked
released
tramadols
doc
medical
m
dog
lpl
tha
wrecked
fitted
lyrics
labels
ending
lethal
earth
nevada
alcohols
lessons
orleans
busy
hrs
folks
ocs
rice
plate
wide
sleepy
stop
da
watson
christopher
happiest
dr
learned
lmao
bar
dipping
patch
bag
bad
piggy
ems
release
appendectomy
bah
headed
testing
goodnight
decided
best
lancaster
shroomery
lots
away
rings
r
finger
hopefully
tolerance
zooted
warrior
nature
rolled
wean
weak
wth
news
motto
drowsy
cop
0p
cow
ill
unisa
games
cod
lookin
guwop
tone
seizure
hubbys
pregnancy
diff
abdominal
tiny
confident
beer
ak47
lovely
chug
life
drugs
suppress
exctacy
kudos
spin
save
tank
delly
hat
n
suppose
teachers
aid
partum
mexico
oswego
iv
ii
player
dizzy
piercings
id
abscess
perform
things
make
amount
10yrs
kakes
ingested
couple
rain
possible
delight
blamed
kid
prescribed
thx
failing
suffering
tho
contact
pandora
mother
alabama
800
dipshit
left
yea
prometh
greys
thanks
lortab
hal
ease
5s
pharmacy
board
5k
zillion
stomped
plasma
gave
elevation
bands
breaks
addicts
birth
dreams
xbox
unsuspecting
dissociative
night
mallis
crowd
people
crown
dead
scrimmage
dear
theyre
finna
bottom
downfalls
fox
ice
everything
asking
morhpine
hurtsss
officer
pls
dental
discount
post
super
valium
meth
tricor
moscato
cliche
stoked
sept
duke
quaaludes
whats
sod
som
ppl
thankful
daffy
deal
gig
fucking
seeker
refills
happy
lowest
head
heal
hydrocodo
removed
apap
crystal
medication
qid
drive
exist
door
dent
check
shit
200mg
floor
til
ny
pasadena
vicodin
holding
acetaminophen
test
nr
roll
felt
coronas
fell
weekend
babysitting
faster
apology
potato
assume
packets
antibiotics
daily
pet
time
songs
neighbors
relieve
greeaaatt
romcom
certainly
contemplating
hurtin
finally
recipe
choice
stays
join
blast
beiber
cool
clouds
level
tear
die
brother
cloudy
p
quick
guy
wellbutrin
dis
talked
suess
porn
sigh
sign
cost
run
heres
ucbp
lmaoooo
filled
water
knocked
congestion
decipher
teacher
change
wait
box
boy
sleepwalk
tylenols
canadian
shift
bruises
proud
hby
pediatric
boo
20mg
dick
love
extra
bs
percocets
touchdown
rarely
schenectady
market
working
perk
dude
sports
live
pres
aspirin
clue
ignorant
oop
savior
fly
car
cat
soup
hope
ull
making
conversatin
dosage
spy
crazy
nursing
fuck
sample
heard
dropped
allowed
painkillers
swedish
s1
dinner
lounge
fourth
absolute
detoxing
spot
4th
tipped
mad
guys
man
remember
liquid
conscious
slightly
borrowing
corona
q
switch
deposit
talk
exclusive
nerve
shaky
wishing
years
ended
cold
whaaat
converasation
paradoxically
thank
interesting
faves
forms
main
happened
moms
conversations
feelin
lunch
touching
half
bath
discuss
wont
roxicet
clutch
drop
debating
concerta
peasant
pharmacies
em
square
fired
hiccups
yeah
breakthrough
year
girl
lesson
er
canada
living
jackson
formula
shows
nikki
brooks
quart
dependencies
grandma
cough
10mg
motion
thing
place
pepperoni
first
zan
saving
rachel
xd
long
sounds
drove
tomorrow
ripping
checked
caught
carson
2
escort
white
friend
eyes
hug
huh
cops
ridiculous
butt
appreciated
boyfriend
10
13
15
14
tbh
16
gotta
future
san
chloe
pro
prn
turned
marijuana
zyntex
tastes
mochaccino
tylenol
sat
stoners
advil
middletown
congestions
note
omfg
online
strengths
blunt
switching
bitching
pain
theatre
normal
arguing
price
knew
paid
falls
printed
knee
considered
dream
8mg
heat
tooth
professional
shot
show
cheap
bright
surgically
takin
line
aint
slow
fibro
tears
adderll
generi
hostage
killers
awaiting
morning
clowns
finishing
comanche
noisier
concert
committed
asleep
parking
surgery
sport
concern
label
3
chews
reading
snorted
dome
killing
blame
coma
tub
jc
reaction
contract
s
loudly
mane
expression
duty
pot
period
pop
60
pabst
turkey
west
508
outweighed
500
robanix
offered
wake
sound
slumber
cash
handicapped
ive
purse
mixtape
bros
sleeping
good
motivated
toothache
everyday
worry
ritalin
doctor
pay
bowl
ya
wizards
urself
struggling
breakdown
driver
bumpin
oxycontin
fruit
totally
misdirection
threaded
daytona
educating
severe
relief
bottle
reward
professionals
money
kill
ketamine
death
hint
thinking
lets
perth
4
pill
real
riker
psa
sandman
gonna
early
insist
mom
amp
lady
christina
pregnant
oblivion
nose
whatcha
joking
snatched
ibuprofen
thinks
irsays
lotta
scottie
stops
moon
starkville
buddha
cramps
asap
itching
strained
tuition
drums
exciting
throw
beaches
william
oc
neighbor
mixed
os
ladies
youd
snapchat
bedtime
elementary
intervention
hep
hes
crunk
hey
lol
lor
start
drank
low
lot
actavis
allergic
jus
bullet
dawg
dispensing
ohh
af
taste
ah
ak
aj
deep
general
tasty
formulation
az
hospitals
cream
hasnt
drafts
diarrhea
5
xanax
teeth
cove
seriousness
brandy
pool
missed
building
wife
lortabgt
stockpile
u
oral
original
growling
rx
month
code
oxycodone
follow
imma
lining
ts
tk
tf
ta
case
woman
worse
1pm
utis
heavenly
worst
fall
awful
difference
heaven
drugged
laying
sedation
throbbing
magdalene
ass
grabs
past
orgasm
pass
90s
sun
sum
fucks
emotions
crush
colonists
nurse
guns
sux
kims
hungover
loose
hours
smartest
strong
shoulda
ahead
mdma
pics
prior
airport
lorcet
milkshake
pick
prescrived
hernya
put
seroquel
eye
6
injury
minor
yuck
excuse
flag
basically
broke
hurry
town
keeping
hour
offender
sucks
mall
phenergan
v
nini
compare
lude
bffs
joints
accept
autumn
lolol
sense
opana
information
court
breaking
oye
goat
wyte
fr
shouldnt
ft
advice
numb
coming
fo
humbug
short
morphine
brady
documentation
overnight
methadone
pleasure
egg
rectors
september
developed
sooo
tramadol
trade
telling
isnt
scott
signs
hell
lisinopril
25
20
actually
late
demoral
bout
suboxone
hurting
evening
hysterectomy
yo
food
starbucks
party
foot
instructions
desperately
klonopins
purdue
fully
nauseous
habits
shekels
1am
found
heavy
week
everyone
roxicodone
upstairs
weight
house
fish
hard
idea
accidentally
loopy
insurance
braided
alcohol
krokodil
relaxers
health
7
salute
benjamin
drifting
guess
pub
effect
inscribed
reason
heroin
asf
imagine
ask
teach
weed
fuggggggggg
terrible
yall
consequence
apocalypse
fallen
dont
feel
groton
number
infinite
adderal
miss
passes
story
script
passed
mama
syrup
store
headache
selling
pains
dentist
doctors
focusing
believe
neuropathic
kind
b
freud
supposed
dang
wasnt
honeys
ages
7s
blissful
orders
percosets
sell
vicadin
lil
couch
play
experienced
nasal
decongestant
nothing
extremely
admitted
funnier
moonshine
clear
cover
clean
latest
lying
ugh
stoned
hopped
fine
find
paranoid
waiting
pretty
8
hip
zanbars
hit
grannys
biopsy
trees
cheaper
feels
longest
vomming
emails
typos
oxy
medicines
hrpb
alotta
common
withdrawal
x
bars
set
art
throwing
xannys
sex
dumb
barf
close
arm
knees
movin
vitamins
matter
prepper
wow
leg
fans
probably
denomithingy
available
milder
weeeeird
recently
commercial
sold
buuuttt
pepsi
ahot
pissed
prescription
memorized
barely
norcos
alot
point
reasons
cdeine
wen
newborn
expensive
headaches
30mg
raise
pt
monthly
autocorrect
whos
hitting
pa
damn
po
woke
pm
kathy
sending
transferring
awake
plants
loom
reliable
battling
fun
hoping
rip
ecstasy
hydrocodone
triple
promethazine
rid
chase
funny
anymore
migraine
concoction
9
calamine
itch
yesterday
assortment
residents
wheres
hows
codeine
obviously
person
entry
norcolortab
world
letting
cut
cus
cup
workers
fentanyl
barack
plainfield
parents
crying
easter
lortabs
emergency
loss
big
ambien
jerked
shitty
redeem
bit
jacksonville
knock
shaped
ignore
nipple
soma
30s
back
palm
loser
scale
xans
decision
gimme
meds
prom
dating
prob
laughing
eating
rapping
bc
bm
elixir
wouldnt
netflix
oatmeal
awwww
idk
dads
wonders
wanna
gamma
opioid
visit
momma
jonny
clonopin
motrin
question
fast
camera
bruh
hopes
injection
relaxer
posted
info
cramping
percocet
horned
um
uh
tonsillectomy
similar
called
supervisor
raging
cure
cafe
cotton
fixing
nah
strapped
occasional
nap
picking
nice
ativan
helping
frybread
ago
happier
vico
vics
hella
came
2009
oxycotin
aguilera
gt
tweeter
hyper
legal
itll
send
oclock
helps
conversating
80mg
random
torture
hydroco
mixing
surgeon
nausea
magic
gettin
tre
ryan
havent
carter
everythings
jump
today
video
acid
odd
exstacy
3x
keepme
giving
caffeine
expressed
sweaty
cell
payday
exercise
toast
led
exchange
prescribe
sink
invented
great
robaxin
involved
30
opiate
mescal
justice
relafen
weddin
makes
named
flexeril
lords
wit
names
duck
gateway
cloud
dosent
spasms
crap
doubt
fer
hydro
popped
started
opiates
infection
flexaril
ride
meet
saba
didnt
control
slip
painkiller
process
itchies
purposes
high
professor
tab
trumpet
sis
sir
sit
vibe
trazadone
swear
baffles
watch
discomfort
abuse
realized
excedrin
counter
lines
necklace
addiction
discussion
move
whilst
dming
including
nasty
glen
write
lo
lt
choose
stalled
2014
bye
rsvp
dad
crucial
docs
dat
sweets
hands
flee
day
ecstacy
speaks
l4
truth
shaking
constitute
books
slumped
80
oxycotton
ebooks
defend
does10mg
hilarious
red
shots
molly
completely
sitting
comrade
area
times
conversation
valiums
jesus
embarrassed
surgree
bitch
quality
braces
management
ordering
pots
system
attach
ankle
perfectly
spaceship
4vdka
stomach
shelf
gotcha
exactly
july
haven
neck
boring
bed
bet
tabs
perkiset
spelled
comfortable
tonight
goodie
apparently
unbearable
afraid
min
studying
mix
brand
combat
procure
zombification
class
demerol
absolutely
148330
stronger
disease
face
fact
impression
text
supported
bring
woth
seaweed
ha
earned
jaw
score
tape
lemme
combo
bourbon
52
lorratab
achieve
outchea
handle
pharmacology
watching
dope
sipping
joint
words
werent
sinus
brain
h
stuff
tightening
grab
sho
temporarily
exists
accused
closet
attempting
icecream
written
correctly
felony
fentynal
addic
kicking
job
police
endo
unstoppable
hits
career
joke
taking
drug
busted
tactical
glorious
wall
cb
tuesday
aleve
walk
cw
journalbuy
quit
poured
treat
hmu
otc
crappy
awhhh
bull
kicks
folding
reclassified
homer
cvs
hahaha
hubs
au
crohns
supply
vi
helped
generic
anesthesia
outbreak
fill
gewd
drink
dusa
fucker
ion
student
fucked
center
mention
banging
thought
1
muscle
hmmph
stores
mfg
moments
storage
dose
mfs
seats
tough
paul
rapid
drunk
smith
vyvanse
crack
warrant
wimpy
kick
checking
fyi
crushed
whopping
immediately
2nd
benadryl
lost
4my
candy
lose
works
sprain
replacement
accessible
klonopin
nigga
twitter
library
hair
shes
home
literally
leah
bosses
schedule
dangling
journal
peas
somas
pasta
tonics
rare
justin
dilaudid
shipping
perks
blessings
motherland
functional
screamed
chronic
doesnt
promise
theyd
roads
couldnt
enuff
convicted
wack
2k15
meeee
rushed
buy
bus
coke
delivery
ho
trimester
ear
eat
bud
count
made
official
hosting
whoa
stories
empty
hand
adderall
problem
minutes
goodness
shooting
happen
800s
packs
treatment
pills
47s
popping
sick
monday
stay
chance
kinda
pacify
friends
balcony
understand
gardens
